# print("Hello world")
# print(2+2)
#
# print("Hello world")
#     #print(2+2)
#
# if 1<2:
#     print("Привет")
# else:
#     print("Пока")
#
# #регистро зависимость
# print("Привет")
# # Print("Привет") неправильно
#
# # коментарии
#
# # строчные
# # print("Привет") вывод инфы на консоль
#
# # блочные
#
# # нельза назыв переменые
# '''  False      await      else       import     pass
# None       break      except     in         raise
# True       class      finally    is         return
# and        continue   for        lambda     try
# as         def        from       nonlocal   while
# assert     del        global     not        with
# async      elif       if         or         yield '''
#
# name = "Анастосия"
# print(type(name)) #для понятия что за тип переменое
# # два типа наименования переменых
# # camel case
# userName="Fil"
#
# # underscore notation
#
# users_name="Fil"
#
# age = 23
# Age = 23
# age = 34
# print(age)
#
# #Числовые типы данных
# '''
# int- Целые числа x=5
# float - вещественный тип данных(число с плавающей точкой) y=5.6
#
# '''
#
# #Текстовые типы данных
# '''
# str - Строка, состоящие из символов, заключенных в одинарные или двойные кавычки
# name="Фил"
# '''
# #Логические типы данных
# '''
# bool - Логические значения (True-истина,False-ложь)
#
# is_activate=True
# '''
#
# #Cписки и коллекции
#
# #None
# '''
# NoneType- особый тип данных, который представляет отсутствие значения
# z=None
# '''
# x = 5
# y = 5.6
# is_activate=False
# r = None
# name = "Fil"
# name1 = "Fil"
#
# print(x,y,is_activate,r,name1,name)
#
# # print("значениеб end=конечный символ")
# # print("привет мир",end=" ")
# # print("привет мир", end=" и пока")
#
# # name = input("Введите имя" )
# # print(name)
# #
# # age = int(input("введите возрвст "))
# # print(age)
#
# 2-10
# a =0b11
# b = 0b1011
#
# print(a,b)
# 8 ричная
# a1 = 0o7
# b1 = 0o11
# print(a1,b1)
# # 16-10
# s = 0x0A
# print(s)
#
# name2 = (input("введите имя: "))
# print(f'Привет' ,name2, '!')
#
# a = float(input("Введите длину: "))
# b = float(input("Введите ширену: "))
#
# print(f'площядь:{a*b} периметор:{a+b}')

# явное преобразование
# x = 10
# y = str(x)
# z = float(x)
# print(type(y))
# print(type(z))

# неявное преобразование
# y = 6
# x = y+8.9
# print(type(x))

# ccomplexNumber = 2+3j
# print(ccomplexNumber)

# ''' Управляющие последовательности в строке
#
# Строка может содержать ряд специальных символов - управляющих последовательностей.
#
# Некоторые из них:
#
# \: позволяет добавить внутрь строки слеш
#
# ': позволяет добавить внутрь строки одинарную кавычку
#
# ": позволяет добавить внутрь строки двойную кавычку
#
# \n: осуществляет переход на новую строку
#
# \t: добавляет табуляцию (4 отступа)
#
# '''


# text = "Сщщбщение: \n\"Привет друзья!\""
# print(text)
#
# text1 = "Привет\t друзья!"
# print(text1)

# print(значение, end=онечные символы)
# print("привет", end= " ")
# print("Привет", end= " друзтя ")

# арифметические операции
# + - / *
# // - целочисленое диление
# % - остаток от деления
# ** - степень

# print(5+5)
# print(10-5)
# print(3*4)
# print(8/2)
# print(25//4)
# print(50%26)
# print(2**2)

# ** - справо направо
# * // / % слева направо
# + - слева на право

# number = 3+4*5**2+7
# print(number)
# # 5**2=25
# 25*4=100
# 100+3=103
# 103+7=110



# s = 5
# s += 5 #s=s+5
# s -= 5
# s *= 5
# s /= 5
# s //= 5
# s %= 5
# s**=5
# print(s)

# округление чисел

# num_1 = 2.0001
# num_2 = 5
# num_3 = num_1+num_2
# print(num_3)
# print(round(num_3,2))


# операторы сравнения
# res = (5>3)
# print(res)
# res = (5<3)
# print(res)
# res = (5==3)
# print(res)
# res = (5!=3)
# print(res)
# res = (5<=3)
# print(res)
# res = (5>=3)
# print(res)

# будет правда если оба истина
# num = (5>3) and (6==6)
# print(num)
#
# # будет правда если хоть 1 истина
# num_1 = (5>3) or (6==9)
# print(num_1)
#
# # bydthcbz ,skj kj; cnfytn ghfdlf
# num_2 = not(5==7)
# print(num_2)



# ператоры членства
# r = [1,2,3,4]
# resl = 1 in r
# resl1 = 5 not in r
# print(resl)
# print(resl1)

# print( 'операторы тождевствености')
# r = [1,2,3,4]
# u = r
# print(u is r)
#
# i = [1,2,3]
# o = [1,2,3]
# print(i is not o) # несылается ли


# пользователь вводит 2 числа погрома выводит сумму разность вычисления всех арифмитических опер

# a = float(input('введите первое число: '))
# b = float(input('введите второе число: '))
# print(f' сумма: {a+b}, разность:{a-b},произведени:{a*b}, частное:{a/b}, степень:{a**b},остаток:{a//b},делениебез остатка:{a%b} ')

# пользователь вводит радиус круга прога вычисляет площядь круга
# из цельсия в фарингейта
# радиус шара вычис объём
# 3 числа вычисляет средне арифмитическое

# a = float(input("первое число: "))
# b = float(input("первое число: "))
# c = float(input("первое число: "))
# s = a+b+c
# print(f" среднее арифметическое: {s/3})

# a = float(input("Введите радиус: "))
# d = 3.14 * a**2
# print(d)


# i = [1,2,3]
# o = [1,2,3]
# print(i is not o)

#условные операторы/конструкции
# if условие:
#    блок кода который выполняется если условие истено или = True
# ледующий блок кода
# x = 4
# if x>5:
#     print("х больше 5")

# water = 45
# money = float(input("Введите количество денежных средств: "))
#
# if money>=water:
#     print("Вы можете приобрести воду")
# else:
#     print("Недостаточно средств")
#     kol = water-money
#     print(f'вам не хвотает {kol}')
#
# x = 4
# if x>5:
#     print(f"х больше 5")
# else:
#     print("х меньше 5")


# x = 23
# if x>10:
#     print("х больше 10")
#     if x>20:
#         print("х больше 20")
#     else:
#         print("х больше 10 , но меньше или равно 20")
# else:
#     print("х меньше или равно 10")
# тернарный оператор
# x = 10
# if x>5:
#     print("х больше 5")
# result="ч больше 5" if x>5 else "ч не больше 5"
# print(result)
#
# if - роверяет перве условие
# elif - проверяет следующие условя, если предыдущее условие было ложно
# else - выполняет блок, если все предыдушие были ложные

# if условие1:
#      блок кода1
# elif условие 2:
#     блок кода2
# elif условие 3:
#     блок кода3
# else:
#     блок кода 4

# x = 7
# if x>10:
#     print("х больше 10")
# elif x>5:
#     print("х больше 5,но меньше или равен 10")
# elif x>0:
#     print("х больше 0,но меньше или равен 5")
# else:
#     print("х меньше или равен 5")

#
# age=int(input("Введите возраст: "))
# if age>=18:
#     print( "Воход разрешон")
# else:
#     print("Вход запрещён")

# пользователь водит первую и последнию букву алфавита если да верно если нет неверно
#
# a = input("Введите первую букву: ")
# z = input("Введите последнию букву ")
# if (a == "а" or a == "А") and (z == "я" or z == "Я"):
#     print("всё верно")
# else:
#     print("неверно")


# сокращёная запись
# if x>=0 and x<100
# if x 0<=x<100

#
# a = float(input("Введите первую сторону: "))
# b = float(input("Введите вторую сторону: "))
# c = float(input("Введите третью сторону: "))
# if a+b>c and a+c>b and c+b>a:
#     print("Треугольник существует")
# else:
#     print("Треугольник не существует")

# a = float(input("Введите балл: "))
#
# if a >= 90:
#     print("отлично")
# elif a >= 75:
#     print("хорошо")
# elif a >= 60:
#     print("удовлетворительно")
# elif a > 0:
#     print("неудовлетворительно")
# else:
#     print("некорректный балл")







